#include "TrainException.h"

//конструктори класу
//--------------------------------------------------------------------------------------------------------------
TrainException::TrainException(std::string error, std::string string_error)
{
	this->error = error;
	this->string_error = string_error;
}
//--------------------------------------------------------------------------------------------------------------
TrainException::TrainException(std::string error)
{
	this->error = error;
}
//--------------------------------------------------------------------------------------------------------------
//повертає стрічку із основною помилкою
std::string TrainException::getError()
{
	return this->error;
}
//--------------------------------------------------------------------------------------------------------------
//повертає стрічку деталей помилки
std::string TrainException::getStringError()
{
	return this->string_error;
}
//--------------------------------------------------------------------------------------------------------------