#pragma once

#include <string>
#include <exception>

class TrainException : public std::exception
{
private:
	
	std::string error; //м≥ститьс€ основна ≥нформац≥€ про помилку
	std::string string_error; //м≥ститьц€ ≥нформац≥€ щодо деталей помилки або ж де саме вона трапилась

public:
	//конструктори класу
	//--------------------------------------------------------------------------------------------------------------
	TrainException(std::string error, std::string string_error);
	//--------------------------------------------------------------------------------------------------------------
	TrainException(std::string error);
	//--------------------------------------------------------------------------------------------------------------
	//повертаЇ стр≥чку ≥з основною помилкою
	std::string getError();
	//--------------------------------------------------------------------------------------------------------------
	//повертаЇ стр≥чку деталей помилки
	std::string getStringError();
	//--------------------------------------------------------------------------------------------------------------
};

